from colorama import Back, Fore, Style

# --- Сообщения ---
WELCOME_M = "Привет! Я могу форматировать тексты, в зависимости от ваших пожеланий. Просто отправьте мне текст и изменяйте в пару нажатий.\n\nby firecoding"

# ---


# --- Кнопки ---
UPPER = "🔼 Верхний Регистр"
LOWER = "🔽 Нижний Регистр"
CAPTIALIZE = "1️⃣ 1 Буква"
REMOVE_SYM = "🅰 Удалить символ"

# ---

# --- Ошибки ---
ONE_SYMBOL = "❌ Вам нужно ввести только один символ."
NO_FOUND = "❌ В тексте отсутствует набранный вами символ."

# ---

RESET = f"{Style.RESET_ALL}"